app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "product_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["product_id", 3], ["body", ""], ["created_at", "2017-06-26 11:49:22.540501"], ["updated_at", "2017-06-26 11:49:22.540501"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save