app/controllers/products_controller.rb

  def show
    @product = Product.find(params[:id])
    @comments = @product.comments.includes(:user).all
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 3]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "stock", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "aaa"], ["price", 12], ["stock", 12], ["note", "too"], ["created_at", "2017-06-27 08:00:15.056119"], ["updated_at", "2017-06-27 08:00:15.056119"]]