app/views/products/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
        <p><%= comment.body %></p>
	<footer><%= comment.user_id %><%= @user.find_by(id: comment.user_id)['email'] %></footer>